<?xml version="1.0" ?>
<net name="opt4_FP16" version="10">
	<layers>
		<layer id="0" name="images" type="Parameter" version="opset1">
			<data element_type="f16" shape="1, 384, 640, 3"/>
			<output>
				<port id="0" names="images" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>640</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="398" type="Const" version="opset1">
			<data element_type="i64" offset="0" shape="4" size="32"/>
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Transpose_0" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>384</dim>
					<dim>640</dim>
					<dim>3</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="127" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="128" type="Const" version="opset1">
			<data element_type="f16" offset="32" shape="1, 1, 1, 1" size="2"/>
			<output>
				<port id="0" names="128" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Div_2" type="Multiply" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="129" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="158" type="Const" version="opset1">
			<data element_type="i64" offset="34" shape="6" size="48"/>
			<output>
				<port id="0" names="158" precision="I64">
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Reshape_28" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>384</dim>
					<dim>640</dim>
				</port>
				<port id="1" precision="I64">
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="2" names="159" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>192</dim>
					<dim>2</dim>
					<dim>320</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="396" type="Const" version="opset1">
			<data element_type="i64" offset="82" shape="6" size="48"/>
			<output>
				<port id="0" precision="I64">
					<dim>6</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Transpose_29" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>3</dim>
					<dim>192</dim>
					<dim>2</dim>
					<dim>320</dim>
					<dim>2</dim>
				</port>
				<port id="1" precision="I64">
					<dim>6</dim>
				</port>
			</input>
			<output>
				<port id="2" names="160" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2</dim>
					<dim>3</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="177" type="Const" version="opset1">
			<data element_type="i64" offset="130" shape="4" size="32"/>
			<output>
				<port id="0" names="177" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Reshape_47" type="Reshape" version="opset1">
			<data special_zero="true"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>2</dim>
					<dim>2</dim>
					<dim>3</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" names="178" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="m.m.model.0.conv.conv.weight" type="Const" version="opset1">
			<data element_type="f16" offset="162" shape="32, 12, 3, 3" size="6912"/>
			<output>
				<port id="0" names="m.m.model.0.conv.conv.weight" precision="FP16">
					<dim>32</dim>
					<dim>12</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Conv_48/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>12</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>12</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Conv_48/Dims3444" type="Const" version="opset1">
			<data element_type="f16" offset="7074" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Conv_48" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="179" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Mul_50" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</input>
			<output>
				<port id="1" names="181" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="m.m.model.1.conv.weight" type="Const" version="opset1">
			<data element_type="f16" offset="7138" shape="64, 32, 3, 3" size="36864"/>
			<output>
				<port id="0" names="m.m.model.1.conv.weight" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Conv_51/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>192</dim>
					<dim>320</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Conv_51/Dims3528" type="Const" version="opset1">
			<data element_type="f16" offset="44002" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Conv_51" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="182" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Mul_53" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" names="184" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="m.m.model.2.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f16" offset="44130" shape="32, 64, 1, 1" size="4096"/>
			<output>
				<port id="0" names="m.m.model.2.cv1.conv.weight" precision="FP16">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Conv_54/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Conv_54/Dims3456" type="Const" version="opset1">
			<data element_type="f16" offset="48226" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Conv_54" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="185" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Mul_56" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" names="187" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="m.m.model.2.m.0.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f16" offset="48290" shape="32, 32, 1, 1" size="2048"/>
			<output>
				<port id="0" names="m.m.model.2.m.0.cv1.conv.weight" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Conv_57/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Conv_57/Dims3486" type="Const" version="opset1">
			<data element_type="f16" offset="50338" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Conv_57" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="188" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Mul_59" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" names="190" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="m.m.model.2.m.0.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f16" offset="50402" shape="32, 32, 3, 3" size="18432"/>
			<output>
				<port id="0" names="m.m.model.2.m.0.cv2.conv.weight" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Conv_60/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Conv_60/Dims3474" type="Const" version="opset1">
			<data element_type="f16" offset="68834" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Conv_60" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="191" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Mul_62" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" names="193" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Add_63" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2" names="194" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="m.m.model.2.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f16" offset="68898" shape="32, 64, 1, 1" size="4096"/>
			<output>
				<port id="0" names="m.m.model.2.cv2.conv.weight" precision="FP16">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Conv_64/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Conv_64/Dims3366" type="Const" version="opset1">
			<data element_type="f16" offset="72994" shape="1, 32, 1, 1" size="64"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Conv_64" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="195" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Mul_66" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" names="197" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Concat_67" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="2" names="198" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="m.m.model.2.cv3.conv.weight" type="Const" version="opset1">
			<data element_type="f16" offset="73058" shape="64, 64, 1, 1" size="8192"/>
			<output>
				<port id="0" names="m.m.model.2.cv3.conv.weight" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Conv_68/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Conv_68/Dims3534" type="Const" version="opset1">
			<data element_type="f16" offset="81250" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Conv_68" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="199" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Mul_70" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</input>
			<output>
				<port id="1" names="201" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="m.m.model.3.conv.weight" type="Const" version="opset1">
			<data element_type="f16" offset="81378" shape="128, 64, 3, 3" size="147456"/>
			<output>
				<port id="0" names="m.m.model.3.conv.weight" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Conv_71/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>96</dim>
					<dim>160</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Conv_71/Dims3552" type="Const" version="opset1">
			<data element_type="f16" offset="228834" shape="1, 128, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Conv_71" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="202" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Mul_73" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" names="204" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="m.m.model.4.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f16" offset="229090" shape="64, 128, 1, 1" size="16384"/>
			<output>
				<port id="0" names="m.m.model.4.cv1.conv.weight" precision="FP16">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Conv_74/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Conv_74/Dims3384" type="Const" version="opset1">
			<data element_type="f16" offset="245474" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Conv_74" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="205" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Mul_76" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" names="207" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="m.m.model.4.m.0.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f16" offset="245602" shape="64, 64, 1, 1" size="8192"/>
			<output>
				<port id="0" names="m.m.model.4.m.0.cv1.conv.weight" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Conv_77/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Conv_77/Dims3510" type="Const" version="opset1">
			<data element_type="f16" offset="253794" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Conv_77" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="208" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Mul_79" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" names="210" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="m.m.model.4.m.0.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f16" offset="253922" shape="64, 64, 3, 3" size="73728"/>
			<output>
				<port id="0" names="m.m.model.4.m.0.cv2.conv.weight" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Conv_80/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Conv_80/Dims3558" type="Const" version="opset1">
			<data element_type="f16" offset="327650" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Conv_80" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="211" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Mul_82" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" names="213" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Add_83" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2" names="214" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="m.m.model.4.m.1.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f16" offset="327778" shape="64, 64, 1, 1" size="8192"/>
			<output>
				<port id="0" names="m.m.model.4.m.1.cv1.conv.weight" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Conv_84/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Conv_84/Dims3606" type="Const" version="opset1">
			<data element_type="f16" offset="335970" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Conv_84" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="215" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Mul_86" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" names="217" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="m.m.model.4.m.1.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f16" offset="336098" shape="64, 64, 3, 3" size="73728"/>
			<output>
				<port id="0" names="m.m.model.4.m.1.cv2.conv.weight" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Conv_87/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Conv_87/Dims3402" type="Const" version="opset1">
			<data element_type="f16" offset="409826" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Conv_87" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="218" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Mul_89" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" names="220" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Add_90" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2" names="221" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="m.m.model.4.m.2.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f16" offset="409954" shape="64, 64, 1, 1" size="8192"/>
			<output>
				<port id="0" names="m.m.model.4.m.2.cv1.conv.weight" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Conv_91/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Conv_91/Dims3624" type="Const" version="opset1">
			<data element_type="f16" offset="418146" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Conv_91" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="222" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Mul_93" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" names="224" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="m.m.model.4.m.2.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f16" offset="418274" shape="64, 64, 3, 3" size="73728"/>
			<output>
				<port id="0" names="m.m.model.4.m.2.cv2.conv.weight" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Conv_94/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>64</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Conv_94/Dims3546" type="Const" version="opset1">
			<data element_type="f16" offset="492002" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Conv_94" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="225" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Mul_96" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" names="227" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Add_97" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2" names="228" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="m.m.model.4.cv2.conv.weight" type="Const" version="opset1">
			<data element_type="f16" offset="492130" shape="64, 128, 1, 1" size="16384"/>
			<output>
				<port id="0" names="m.m.model.4.cv2.conv.weight" precision="FP16">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Conv_98/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>64</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Conv_98/Dims3600" type="Const" version="opset1">
			<data element_type="f16" offset="508514" shape="1, 64, 1, 1" size="128"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Conv_98" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="229" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Mul_100" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" names="231" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Concat_101" type="Concat" version="opset1">
			<data axis="1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="2" names="232" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="m.m.model.4.cv3.conv.weight" type="Const" version="opset1">
			<data element_type="f16" offset="508642" shape="128, 128, 1, 1" size="32768"/>
			<output>
				<port id="0" names="m.m.model.4.cv3.conv.weight" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="Conv_102/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Conv_102/Dims3660" type="Const" version="opset1">
			<data element_type="f16" offset="541410" shape="1, 128, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Conv_102" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="233" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Mul_104" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1" names="235" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="m.m.model.5.conv.weight" type="Const" version="opset1">
			<data element_type="f16" offset="541666" shape="256, 128, 3, 3" size="589824"/>
			<output>
				<port id="0" names="m.m.model.5.conv.weight" precision="FP16">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="Conv_105/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="1, 1" pads_end="1, 1" strides="2, 2"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>48</dim>
					<dim>80</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>256</dim>
					<dim>128</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>24</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Conv_105/Dims3492" type="Const" version="opset1">
			<data element_type="f16" offset="1131490" shape="1, 256, 1, 1" size="512"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="Conv_105" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>24</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="236" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>24</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Mul_107" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>24</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" names="238" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>24</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="m.m.model.6.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f16" offset="1132002" shape="128, 256, 1, 1" size="65536"/>
			<output>
				<port id="0" names="m.m.model.6.cv1.conv.weight" precision="FP16">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="Conv_108/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>256</dim>
					<dim>24</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>256</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>24</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Conv_108/Dims3342" type="Const" version="opset1">
			<data element_type="f16" offset="1197538" shape="1, 128, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Conv_108" type="Add" version="opset1">
			<data auto_broadcast="numpy"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>24</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" names="239" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>24</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Mul_110" type="Swish" version="opset4">
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>24</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1" names="241" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>24</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="m.m.model.6.m.0.cv1.conv.weight" type="Const" version="opset1">
			<data element_type="f16" offset="1197794" shape="128, 128, 1, 1" size="32768"/>
			<output>
				<port id="0" names="m.m.model.6.m.0.cv1.conv.weight" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Conv_111/WithoutBiases" type="Convolution" version="opset1">
			<data auto_pad="explicit" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" strides="1, 1"/>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>24</dim>
					<dim>40</dim>
				</port>
				<port id="1" precision="FP16">
					<dim>128</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>24</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="Conv_111/Dims3564" type="Const" version="opset1">
			<data element_type="f16" offset="1230562" shape="1, 128, 1, 1" size="256"/>
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>128</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
